app/controllers/floors_controller.rb

SELECT "floors".* FROM "floors"
---
  def index
    @floors = Floor.all

INSERT INTO "floors" ("floorNumer", "created_at", "updated_at") VALUES (?, ?, ?)  [["floorNumer", 2], ["created_at", "2020-03-13 00:32:59.445057"], ["updated_at", "2020-03-13 00:32:59.445057"]]
---
  def create
    @floor = Floor.new(floor_params)

    respond_to do |format|
      if @floor.save

SELECT "floors".* FROM "floors" WHERE "floors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_floor
      @floor = Floor.find(params[:id])