app/controllers/proffesions_controller.rb

  def index
    @proffesions = Proffesion.all
---
SELECT "proffesions".* FROM "proffesions"

  def create
    @proffesion = Proffesion.new(proffesion_params)

    respond_to do |format|
      if @proffesion.save
---
INSERT INTO "proffesions" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Medico"], ["created_at", "2020-03-13 00:36:16.234153"], ["updated_at", "2020-03-13 00:36:16.234153"]]

    def set_proffesion
      @proffesion = Proffesion.find(params[:id])
---
SELECT "proffesions".* FROM "proffesions" WHERE "proffesions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]