app/controllers/residents_controller.rb

  def index
    @residents = Resident.all
---
SELECT "residents".* FROM "residents"

  def create
    @resident = Resident.new(resident_params)

    respond_to do |format|
      if @resident.save
---
INSERT INTO "residents" ("name", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Iago Garcia"], ["age", 20], ["created_at", "2020-03-13 00:28:38.698368"], ["updated_at", "2020-03-13 00:28:38.698368"]]

    def set_resident
      @resident = Resident.find(params[:id])
---
SELECT "residents".* FROM "residents" WHERE "residents"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]